# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [5]:
a = np.random.randint(1, 5, 1000)
b = np.random.randint(1, 4, 1000)
c = np.random.randint(10000, 30001, 1000)

### Step 3. Let's create a DataFrame by joinning the Series by column

In [10]:
data = {'cola':a, 'colb':b, 'colc':c}
df = pd.DataFrame(data=data)
df.head()

   cola  colb   colc
0     4     1  24334
1     3     2  15903
2     4     3  26319
3     2     1  25301
4     1     2  29050

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [14]:
df.rename(columns={'cola':'bedrs', 'colb':'bathrs', 'colc':'price_sqr_meter'}, inplace=True)

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [24]:
d = np.concatenate((a,b,c))
bigcolumn = pd.DataFrame(data=d)
bigcolumn.head()

   0
0  4
1  3
2  4
3  2
4  1

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [26]:
bigcolumn.shape

(3000, 1)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [27]:
bigcolumn.reset_index()

      index      0
0         0      4
1         1      3
2         2      4
3         3      2
4         4      1
...     ...    ...
2995   2995  25355
2996   2996  20150
2997   2997  17768
2998   2998  12264
2999   2999  24572

[3000 rows x 2 columns]